muratgurler/mg-smart-docs/sdkconfig.defaults
# MG Smart Tester Extra30 - JC1060 ESP32-P4 core + mobile profile import
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=360

# Force the same 16 MB custom layout from ESP-IDF itself as well as PlatformIO.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_p4.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_p4.csv"

# JC1060 / ESP32-P4 PSRAM and cache settings.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Arduino as an ESP-IDF managed component. Arduino supplies app_main() and
# calls the existing setup()/loop() from MGSmartTesterMain.cpp.
CONFIG_AUTOSTART_ARDUINO=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Use the project lv_conf_p4.h rather than LVGL component Kconfig defaults.
# CONFIG_LV_CONF_SKIP is not set

# ESP32-P4 uses the onboard ESP32-C6 as remote Wi-Fi via ESP-Hosted/SDIO.
# Arduino-ESP32 3.3.6 pulls esp_hosted + esp_wifi_remote on ESP32-P4.
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y

# Keep the proven low-memory ESP-Hosted SDIO transport settings used on JC1060.
# These settings protect the internal/DMA heap.
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=8
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=8
CONFIG_ESP_HOSTED_DFLT_TASK_FROM_SPIRAM=y

# Give the captive portal enough Wi-Fi buffers for document upload traffic.
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=8
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=16
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=16
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768
CONFIG_LWIP_TCP_WND_DEFAULT=32768
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32
CONFIG_LWIP_UDP_RECVMBOX_SIZE=32
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32
CONFIG_LWIP_TCP_SACK_OUT=y

# Stage03 BLE-first mobile profile transfer. ESP32-P4 runs the NimBLE host;
# the onboard ESP32-C6 remains the remote controller over ESP-Hosted SDIO/VHCI.
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
# CONFIG_BT_BLUEDROID_ENABLED is not set
CONFIG_BT_NIMBLE_ENABLED=y
# CONFIG_BT_NIMBLE_TRANSPORT_UART is not set
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y
CONFIG_ESP_HOSTED_NIMBLE_HCI_VHCI=y
